L0/vegeta-testing/1000_req_report.txt
PS C:\Users\busla\Desktop\moe\pargrammirony\L0\vegeta-testing> vegeta attack -duration=5s -rate=1000/s --targets=target.txt --output results.bin
PS C:\Users\busla\Desktop\moe\pargrammirony\L0\vegeta-testing> vegeta report results.bin
Requests      [total, rate, throughput]  4991, 1000.69, 1000.58
Duration      [total, attack, wait]      4.9880837s, 4.9875558s, 527.9µs
Latencies     [mean, 50, 95, 99, max]    8.969003ms, 2.509478ms, 35.932775ms, 111.272793ms, 139.5936ms
Bytes In      [total, mean]              5530028, 1108.00
Bytes Out     [total, mean]              0, 0.00
Success       [ratio]                    100.00%
Status Codes  [code:count]               200:4991
Error Set: